using System;
using System.Collections.Generic;
using EntityCache.Bussines;
using PacketParser.Services;

namespace EntityCache.Assistence.Defualts
{
    public static class DefaultNaqz
    {
        private static List<NaqzBussines> list = new List<NaqzBussines>();
        private static NaqzBussines SetDef(string msg)
        {
            try
            {
                var naqz = new NaqzBussines()
                {
                    Guid = Guid.NewGuid(),
                    Message = msg,
                    UseCount = 0
                };
                return naqz;
            }
            catch (Exception ex)
            {
                WebErrorLog.ErrorInstence.StartErrorLog(ex);
                return null;
            }
        }

        public static List<NaqzBussines> SetDef()
        {
            try
            {
                list.Add(SetDef("زندگی زیباست ، برای ماست ، دوستش بداریم و زیباترش کنیم"));
                list.Add(SetDef("آدمي ساخته ي افكار خويش است فردا همان خواهد شد كه امروز مي انديشيده است"));
                list.Add(SetDef("روح کندوست که به زنبور عسل وحی می کند"));
                list.Add(SetDef("شناختن وظیفه کار مشکلی نیست ولی انجام وظیفه مشکل است"));
                list.Add(SetDef("ترقیات بشر ، زاده عمل و کار انسان است"));
                list.Add(SetDef("اندیشه برتر در روزهای طوفانی و آشوب و در همان حال خموشی و آرامش ، توانایی برتر خویش را از دست نمی دهد"));
                list.Add(SetDef("معلم نفس خود و شاگرد وجدان خویش باش"));
                list.Add(SetDef("دانای بی وجدان هیچ گاه صاحب روحی پاک نخواهد بود"));
                list.Add(SetDef("هیچ چیز در این دنیا اتفاقی نیست"));
                list.Add(SetDef("اغلب آنهایی پیروز و موفق می شوند که کمتر تعریف و تمجید شنیده باشند"));
                list.Add(SetDef("تا خود را از هرجهت کامل و شایسته ندیدی ، قضاوت نکن"));
                list.Add(SetDef("حقیقت را همانطور که هست باید پذیرفت"));
                list.Add(SetDef("کیفیت یعنی درست انجام دادن وقتی که هیچ کس نگاه نمی کند"));
                list.Add(SetDef("تنها تضمین شکست خوردن، دست از تلاش برداشتن است"));
                list.Add(SetDef("تجارت و سرمایه گذاری، ورزش های گروهی هستند"));
                list.Add(SetDef("مقام عالی انسانی در برابر شماست. آن را بدست آورید"));
                list.Add(SetDef("به زبانت اجازه نده که قبل از اندیشه ات به کار افتد"));
                list.Add(SetDef("اگرآنچه انجام می دهيد،ناحق باشد،موفقيتی کسب نخواهيد کرد"));
                list.Add(SetDef("وقتی که رويا می بينم ، احساس جوانی می کنم"));
                list.Add(SetDef("لازمه موفقيت ،در توانائی تمرکز انرژی ذهنی و جسمی وبدون وقفه بروی يک مسئله است بی آنکه احساس خستگی کنيد"));
                list.Add(SetDef("آموزش توانسته است جمعيت فراوانی را باسواد کند، امانتوانسته است، به آنها بگويد چه بخوانند"));
                list.Add(SetDef("لباس قديمی را بپوشيد ولی کتاب نو بخريد"));
                list.Add(SetDef("به جاي خود کم بيني و آرمان گريزي ، پاي در راه نهيم که اين تنها درمانگر دردهاي زندگي ست"));
                list.Add(SetDef("هرگز هيچ هدفي را رها مكنيد، مگر اينكه ابتدا قدم مثبتي درجهت تحقق آن برداشته باشيد"));
                list.Add(SetDef("کاميابی تنها در اين است که بتوانی زندگی را به شيوه خودسپری کنی"));
                list.Add(SetDef("سعادت عادت است آنرا پرورش دهيد"));
                list.Add(SetDef("دانشگاه تمام استعدادهای افراد،ازجمله بی استعدادی آنهارا آشکارمیکند"));
                list.Add(SetDef("معاشرت بر دانائی می افزايد ولی تنهائی مکتب نبوغ است"));
                list.Add(SetDef("صرفه جوئی خود يکی از منابع مهم درآمد است"));
                list.Add(SetDef("هدفمندان داراي دلدار ، فرهمندانند"));
                list.Add(SetDef("همه ما نياز داريم كه دائماٌ احساس رشد عاطفي و معنوي كنيم . اين غذايي است كه روح ما به آن محتاج است"));
                list.Add(SetDef("حوادث چون روزها سپری می شوند"));
                list.Add(SetDef("بهترين چاره غضب ، به تاخير انداختن آن است"));
                list.Add(SetDef("شادمانی عبارت است از پروراندن عاليترين صفات و خصايص انسانی"));
                list.Add(SetDef("فرصت از دست مده ودر کارسستی مکن که ميوه آن ذلت است"));
                list.Add(SetDef("تسليم ورضا در برابرحوادث علاج ناپذير، مهمترين توشه سفر زندگی است"));
                list.Add(SetDef("عشق همان چیزی است که به شما امکان می دهد بارها و بارها متولد شوید"));
                list.Add(SetDef("ابله ترين دوستان ما، خطرناک ترين دشمنان هستند"));
                list.Add(SetDef("از عاجزترين مردم کسي است که نتواند دوست پيدا کند و از او عاجزتر آنکه دوستش را از خود دور کند"));
                list.Add(SetDef("بهترينها را در خودتان خواهيد يافت،وقتی در ديگران خوبی بجوئيد"));
                list.Add(SetDef("وقتی آنچه داريم مي بخشيم آنچه را نيازمند آنيم دريافت خواهيم کرد"));
                list.Add(SetDef("کسی که فکر نميکند به ندرت دم فرو ميبندد"));
                list.Add(SetDef("دوست هر کس خرد و دانش او و دشمنش جهل و نادانی اوست"));
                list.Add(SetDef("بهترين دوست تو آنست که اشتباهات تو را فراموش کند و خوبيهايت را به ياد داشته باشد"));
                list.Add(SetDef("به جاي اين كه سعي كنيد مرد موفقيت باشيد، سعي كنيد مرد ارزشها باشيد"));
                list.Add(SetDef("استعداد در انتخاب ها است"));
                list.Add(SetDef("هرگز قبل از فکر کردن حرف نزن و کاری انجام مده"));
                list.Add(SetDef("اگر همواره مانند گذشته بينديشيد، هميشه همان چيزهايي را به دست مي آوريد كه تا بحال كسب كرده ايد"));
                list.Add(SetDef("وقتی انسان دوست واقعی دارد كه خودش هم دوست واقعی باشد"));
                list.Add(SetDef("بين تمامي مردم تنها عقل است كه به عدالت تقسيم شده زيرا همه فكر ميكنند به اندازه كافي عاقلند"));
                list.Add(SetDef("بدترين و خطرناکترين کلمات اينست: «همه اين جورند»"));
                list.Add(SetDef("محبت همه چیز را شکست می دهد و خود شکست نمیخورد "));
                list.Add(SetDef("ما ندرتاً درباره آنچه که داریم فکر می کنیم ، درحالیکه پیوسته در اندیشه چیزهایی هستیم که نداریم"));
                list.Add(SetDef("آنکه می تواند ، انجام می دهد،آنکه نمی تواند انتقاد می کند"));
                list.Add(SetDef("لحظه ها را گذراندیم که به خوشبختی برسیم؛ غافل از آنکه لحظه ها همان خوشبختی بودند"));
                list.Add(SetDef("تمدن، تنها زاییده اقتصاد برتر نیست، در هنر و ادب و اخلاق هم باید متمدن بود و برتری داشت"));
                list.Add(SetDef("باید دنبال شادی ها گشت ولی غمها خودشان ما را پیدا می کنند"));
                list.Add(SetDef("اگر در اولین قدم، موفقیت نصیب ما می شد، سعی و عمل دیگر معنی نداشت"));
                list.Add(SetDef("بهترین چیزها زمانی رخ می دهد که انتظارش را نداری"));
                list.Add(SetDef("اگر جانت در خطر بود بجای پنهان شدن بکوش همگان را از گرفتاری خویش آگاه سازی"));
                list.Add(SetDef("کسی که دارای عزمی راسخ است ،جهان را مطابق میل خویش عوض می کند"));
                list.Add(SetDef("پیروزی آن نیست که هرگز زمین نخوری، آنست که بعد از هر زمین خوردنی برخیزی"));
                list.Add(SetDef("کسی به فرجام زندگی آگاه نیست ، خداوند هم نیازی به عبادت بنده ندارد"));
                list.Add(SetDef("تکامل و حرکت، مبنا و پیش فرض کل وجود است"));
                list.Add(SetDef("بیشترین تأثیر افراد خوب زمانى احساس مى شود که از میان ما رفته باشند"));
                list.Add(SetDef("از دیروز بیاموز. برای امروز زندگی کن و امید به فردا داشته باش"));
                list.Add(SetDef("برای اداره کردن خویش ، از سرت استفاده کن . برای اداره کردن دیگران ، از قلبت"));
                list.Add(SetDef("انسان باید از هر حیث چه ظاهر و چه باطن , زیبا و آراسته باشد"));
                list.Add(SetDef("بهترین آموزگار استاد ، شاگرد اوست"));
                list.Add(SetDef("فاش نكردن اسرار مردم دليل كرامت و بلندي همت است"));
                list.Add(SetDef("بهترين سياست صداقت است"));
                list.Add(SetDef("موفقيت به همان اندازه شكست خطرناك است"));
                list.Add(SetDef("مفيدترين وسيله يك دفتر كار، سبد دورريختنيهاست"));
                list.Add(SetDef("بهترین و حقیقی ترین دوستانم از تهی دستانند . توانگران از دوستی چیزی نمی دانند"));
                list.Add(SetDef("میان گام نخست و آرمان بازه ای نیست ، آنچه داریم اندازه نیروی کنونی ماست"));
                list.Add(SetDef("به من بگو قبل از آمدن به این دنیا کجا بودی؟ تا بگویم بعد از مرگ کجا میروی"));
                list.Add(SetDef("خطر خوشبختی در این است که آدمی در هنگام خوشبختی هر سرنوشتی را می پذیرد و هرکسی را نیز"));
                list.Add(SetDef("انسان هنوز خارق العاده ترين كامپيوتر است"));
                list.Add(SetDef("انسان هيچ وقت بيش تر از آن موقع خود را گول نميزند كه خيال ميكند ديگران را فريب داده است"));
                list.Add(SetDef("آدم شجاع یکبار می میرد ولی ترسو هزار بار"));
                list.Add(SetDef("حافظه پرونده تخیل و گنجینه عقل دفتر ثبت وجدان و مخزن اندیشه است"));
                list.Add(SetDef("یا چنان نمای که هستی ، یا چنان باش که می نمایی"));
                list.Add(SetDef("در هستی جنبش حشرات هم چهار چوبی دارد"));
                list.Add(SetDef("اگر نميتواني بالا بروي پس سيب باش تا با افتادنت انديشه اي بالا رود"));
                list.Add(SetDef("حقيقت نه با شنا کردن بلکه با غرق شدن کشف مي شود شنا کردن حادثه ايست که در سطح اتفاق مي افتد غرق شدن تو را به اعماق بي انتها مي برد"));
                list.Add(SetDef("وقتی چیزی را از دست دادی، درس گرفتن از آن را از دست نده"));
                list.Add(SetDef("گر می خواهی قواعد بازی را عوض کنی اول قواعد را بیاموز"));
                list.Add(SetDef("انسان تا زمانی که تصمیم می گیرد شاد باشد شاد خواهد بود و هیچ چیز نمی تواند مانع او باشد"));
                list.Add(SetDef("انسان نادان در دور دست ها به دنبال شادی می گردد اما انسان دانا آنرادر زیر پاهای خود پرورش میدهد"));
                list.Add(SetDef("بزرگترين پند زندگي اين است كه گاهي احمق ها درست مي گويند"));
                list.Add(SetDef("هر حرکتي که چيزي به وجود شما نيافزايد , چيزي از آن خواهد کاست و حرکتي که اثرش خنثي باشد وجود ندارد !"));
                list.Add(SetDef("از میان کسانی که برای دعای باران به تپه ها می روند تنها آنهایی که با خود چتر به همراه می برند به کار خود ایمان دارند"));
                list.Add(SetDef("به جای آنکه به تاریکی لعنت بفرستید ، یک شمع روشن کنید"));
                list.Add(SetDef("کسی که از هیچ چیز کوچکی خوشحال نمی شود ، هیچگاه خوشبخت نخواهد شد"));
                list.Add(SetDef("مردم اشتباهات زندگی خود را روی هم می ریزند و از آن غولی میسازد که نامش تقدیر است"));
                list.Add(SetDef("اگر کسی تو را آنطور که میخواهی دوست ندارد به این معنی نیست که تو را با تمام وجودش دوست ندارد"));
                list.Add(SetDef("آنان که از خود عشق ساطع می کنند با عشق زندگی می کنند و با عشق نیز نفس می کشند ، دیگران را به سمت خود می کشانند"));
                list.Add(SetDef("در درون جسارت ، نبوغ و قدرت سحر آمیزی نهفته است"));
                list.Add(SetDef("قابليت انعطاف داشته باشيد . تنها همين يك خصوصيت كه بتوانيد شيوه كار خود را تغيير دهيد موفقيت شما را تضمين مي كند"));
                list.Add(SetDef("دوست واقعی کسی است که دستهای تو را بگیرد ولی قلب تو را لمس کند"));
                list.Add(SetDef("عشق یگانه منبع نیرو و قدرت شماست"));
                list.Add(SetDef("قانون احتمالات یادت نره ، بلاخره یک نفر خواهد گفت بله"));
                list.Add(SetDef("آدمهاي فرهمند به نيرو و توان خويش ايمان دارند"));
                list.Add(SetDef("اگر فکر می کنید که موفق می شوید یا شکست می خورید ، در هر دو صورت درست فکر کرده اید"));
                list.Add(SetDef("وقتی انسان آرامش را در خود نیابد ، جستجوی آن در جای دیگر کار بیهوده ای است"));
                list.Add(SetDef("در تاریخ جهان ، هر لحظه عظیم و تعیین کننده ، پیروزی نوعی عشق است"));
                list.Add(SetDef("موفقیت ، یک درصد نبوغ ، 99 درصد عرق ریختن است"));
                list.Add(SetDef("مهم این نیست که در کجای این جهان ایستاده ایم ، مهم این است که در چه راستایی گام بر می داریم"));
                list.Add(SetDef("سعی نکنیم بهتر یا بدتر از دیگران باشیم ، بکوشیم نسبت به خودمان بهترین باشیم"));
                list.Add(SetDef("پیش نیاز دلیر بودن ، بدنی ورزیده نیست ، گاهی آدمهای سبکبار پشت کوهستان را هم به خاک مالیده اند"));
                list.Add(SetDef("مغز ما یک دینام هزار ولتی است که متاسفانه اکثرمان بیش از یک چراغ موشی از آن استفاده نمی کنیم"));
                list.Add(SetDef("آن چه انسان هرگز نخواهد فهمید این است که چگونه در مقابل کسی که ما را آفریده و همه چیز ما از اوست مسئول خواهیم شد و او از ما بازخواست خواهد کرد ؟!"));
                list.Add(SetDef("هر چه عشق و شور زندگی بیشتری از خود ابراز کنید برای دیگران نیز بیشتر مقاومت ناپذیر خواهید شد و آن ها دیگر نخواهند توانست شما را نادیده بگیرند"));
                list.Add(SetDef("سکوي پرش و انتخاب بهتر مي تواند در هر زمان و مکاني بروز کند مهم آنست که تا آن زمان ، پاکي و شادي خويش را نگاه داشت"));
                list.Add(SetDef("تفاوت ميان ايستايي و پويايي با قدرت تصميم گيري مشخص مي شود . اراده خود را قوي سازيد! كافي نيست كه به خود فشار بياوريد بلكه بايد خود را در حالتي مصمم قرار دهيد"));
                list.Add(SetDef("لحظه ها تنها پرندگان مهاجری هستند که هرگز به آشیانه باز نمیگردند ، پس دریابیم لحظه لحظه ی زندگی را"));
                list.Add(SetDef("برو دنبال آرزوهایت ، انسان ها زمانی که دنبال رویاهایشان نمی روند پیر می شوند"));
                list.Add(SetDef("غیرممکن وجود نداره ، غیر ممکن فقط یک کلمه طولانیه"));
                list.Add(SetDef("پاهاتو از گلیمت توی رویاهات درازتر کن ، این جهان به تکرار نیازی نداره ، فرمول هارو بهم بزن ، جهانت رو تغییر بده"));
                list.Add(SetDef("موفقیت یعنی آنطور که دلتان میخواهد زندگی کنید"));
                list.Add(SetDef("هروقت خواستی جابزنی ، به همه ی اون آدمهایی که دوست دارن شکستت رو ببینن فکر کن"));
                list.Add(SetDef("بدترین ورشکستگی در جهان ، از دست دادن اشتیاق است"));
                list.Add(SetDef("هدف بدون برنامه ریزی آرزویی بیش نیست"));
                list.Add(SetDef("اگر بخواهی نعمتی در تو زیاد شود ، باید آن را ستایش کنی"));
                list.Add(SetDef("جرات کن و متفاوت باش ، دنیا کوتاهتر از اونه که بخوای وقتت رو با تکرار و تقلید سپری کنی"));
                list.Add(SetDef("راز آرامش درون ، کار کردن در کنار دیگران است ، نه در مقابل آنها"));
                list.Add(SetDef("روزتون رو از دست ندید ، هروز میتونه شمارو به هدفتون نزدیک کنه"));
                list.Add(SetDef("موفقیت یک انتخاب است و تنها چیزی که مانع تحقق آن می شود ، تفکرات منفی است"));
                list.Add(SetDef("شما هرگز یک دزد را به خانه تان دعوت نمی کنید ، پس چرا اجازه میدهید افکاری که شادی شما را میدزدند ، در ذهنتان سکنی گزینند؟"));
                list.Add(SetDef("مشتریان زبان گویایی دارند, اگر بی‌واسطه با آن‌ها در ارتباط بوده و گوشی شنوا داشته باشیم می‌توان از ایشان چیزهای زیادی یاد گرفت"));
                list.Add(SetDef("هزینه ی به دست آوردن یک مشتری تازه, حداقل پنج برابر هزینه ی خشنود نگه‌داشتن مشتریان کنونی است"));
                list.Add(SetDef("اگر با یك تاریكی مواجه شدید آن را لعن و نفرین نكنید، بلكه سعی كنید شمعی روشن كنید تا قسمت كوچكی از آن تاریكی را روشن كرده باشید"));
                list.Add(SetDef("فروشنده موفق، دو برابر مدتي كه حرف مي زند گوش مي كند"));
                list.Add(SetDef("افراد موفق كارهاي متفاوت انجام نمي دهند، بلكه كارها را به گونه اي متفاوت انجام مي دهند"));
                list.Add(SetDef("هر شكست لااقل اين فايده را دارد كه انسان يكي از راه هايي كه به شكست خوردن منتهي مي شود را مي شناسد"));
                list.Add(SetDef("پيروزي آن نيست كه هرگز زمين نخوري، آنست كه بعد از هر زمين خوردني برخيزي"));
                list.Add(SetDef("پيروزي نصيب افرادي است كه بيش از همه استقامت دارند"));
                list.Add(SetDef("اين ترس از انتخاب است كه قدرت تصميم گيري ما را گرفته است و باعث نوعي ناتواني در تصميم گيري مي شود"));
                list.Add(SetDef("مشتري مداري 2 اصل دارد: اصل اول: هميشه حق با مشتري است. اصل دوم: زماني كه شك داريد كه آيا حق با مشتري است يا نه، به اصل اول مراجعه نمائيد"));
                list.Add(SetDef("موفقيت نتيجه ي قضاوت صحيح است، قضاوت درست از تجربه ناشي مي شود، و تجربه غالبا چيزي جز قضاوت غلط نيست"));
                list.Add(SetDef("اگر ميزان تحولات خارج از سازمان شما بيش از ميزان رشد داخل سازمان باشد، در اين صورت سقوط سازمان حتمي است"));
                list.Add(SetDef("فراموش نكن، قطاري كه از ريل خارج شده است، ممكن است آزاد باشد اما راه به جايي نخواهد برد"));
                return list;
            }
            catch (Exception ex)
            {
                WebErrorLog.ErrorInstence.StartErrorLog(ex);
                return null;
            }
        }
    }
}
